

===================C语言考试改卷规则=======================

1、本题中凡是说明通过返回值返回的数据，
   必须返回，如果函数内打印，该题不得分；

2、未经讲师同意，修改函数声明，该题不得分；

3、普通函数内出现scanf，或getchar等读取方法，该题不得分；

4、不写main函数，一律不得分；

5、如果编程的基本思路与步骤正确，但是编译不通过的，
   总分按原总分的2/3计，但不是最终得分(还要看其他的)；

6、如果编程的基本思路，基本步骤错误，原则上该题不得分
   (或按实际情况给点辛苦分)；

7、如果编译通过，运行能得到正确结果，但是编程的思路很不好，
   不是一种好方法的，适当扣3--8分；

8、如果编程风格不好，写得杂乱无章的，适当扣3--5分；

9、其他出现语法、写法、思路、步骤、架构、参数或代码存在某部分
   缺陷等错误的，根据实际情况灵活掌握扣分，扣分按累加计算。

10、文件名出错影响改卷的，总分扣5分！


==========================over==========================



